acmecpu-repos-cpap-machine/acmecpu-repos-firmware-zephyr-rtos/c201_stm32g4/hardware/stm32cubemx_config/stm32cubemx_config.ioc
#MicroXplorer Configuration settings - do not modify
RCC.USART1Freq_Value=170000000
SPI3.Direction=SPI_DIRECTION_2LINES
SPI3.VirtualType=VM_MASTER
VP_TIM17_VS_ClockSourceINT.Mode=Enable_Timer
SPI2.VirtualType=VM_MASTER
PC12.Signal=UCPD1_FRSTX2
Dma.UCPD1_RX.1.Polarity=HAL_DMAMUX_REQ_GEN_RISING
VP_RTC_VS_RTC_Activate.Mode=RTC_Enabled
PC3.Locked=true
PD2.GPIOParameters=GPIO_Label
PC5.Mode=Asynchronous
USART1.IPParameters=VirtualMode-Asynchronous
VP_USBPD_VS_USBPD1.Signal=USBPD_VS_USBPD1
PB13.Signal=USART3_CTS
PinOutPanel.RotationAngle=0
RCC.MCO1PinFreq_Value=16000000
RCC.SYSCLKSource=RCC_SYSCLKSOURCE_PLLCLK
Dma.USART3_TX.2.Priority=DMA_PRIORITY_LOW
NVIC.DMA1_Channel3_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
USART3.VirtualMode-Asynchronous=VM_ASYNC
RCC.LPTIM1Freq_Value=170000000
Dma.UCPD1_RX.1.SyncRequestNumber=1
NVIC.SVCall_IRQn=true\:0\:0\:false\:false\:false\:false\:false\:false
SH.S_TIM16_CH1.ConfNb=1
SH.S_TIM3_CH2.ConfNb=1
Dma.USART3_TX.2.RequestNumber=1
Dma.UCPD1_TX.0.SyncSignalID=NONE
RCC.I2C4Freq_Value=170000000
TIM2.IPParameters=Channel-Input_Capture1_from_TI1,Channel-PWM Generation2 CH2,Channel-Input_Capture3_from_TI3
RCC.APB2TimFreq_Value=170000000
PB6.Signal=UCPD1_CC1
TIM2.Channel-Input_Capture3_from_TI3=TIM_CHANNEL_3
PC7.Signal=S_TIM3_CH2
PB6.Mode=Dual_Role_AllSignals
PC3.Signal=GPIO_Input
TIM17.IPParameters=Channel
Dma.USART3_TX.2.Mode=DMA_NORMAL
Dma.UCPD1_TX.0.SyncRequestNumber=1
RCC.USART3Freq_Value=170000000
ProjectManager.ProjectBuild=false
Dma.UCPD1_TX.0.RequestNumber=1
NVIC.UsageFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
PB3.Mode=Full_Duplex_Master
PB2.Signal=GPIO_Input
PA8.Locked=true
TIM17.Channel=TIM_CHANNEL_1
RCC.ADC12Freq_Value=170000000
PB12.GPIO_Label=GPIO3
VP_USBPD_VS_PD3FULL.Mode=PD3_Full_Stack
ProjectManager.FirmwarePackage=STM32Cube FW_G4 V1.3.0
MxDb.Version=DB.6.0.10
ProjectManager.BackupPrevious=false
PB14.Mode=CTS_RTS
NVIC.UCPD1_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:false
PA0.Mode=SYS_WakeUp0
PC9.Mode=I2C
SPI2.CalculateBaudRate=42.5 MBits/s
PA8.Signal=GPIO_Input
RCC.PLLRCLKFreq_Value=170000000
NVIC.PendSV_IRQn=true\:15\:0\:false\:false\:false\:true\:false\:false
Dma.UCPD1_TX.0.EventEnable=DISABLE
VP_FREERTOS_VS_CMSIS_V1.Mode=CMSIS_V1
ProjectManager.HalAssertFull=false
ADC1.SamplingTime-0\#ChannelRegularConversion=ADC_SAMPLETIME_2CYCLES_5
PA0.Signal=SYS_WKUP1
Dma.USART3_TX.2.SignalID=NONE
Mcu.Package=LQFP64
PB9.Signal=S_TIM17_CH1
PB1.Signal=QUADSPI1_BK1_IO0
SPI2.Mode=SPI_MODE_MASTER
Dma.USART3_TX.2.SyncEnable=DISABLE
SPI3.Mode=SPI_MODE_MASTER
VP_SYS_VS_Systick.Signal=SYS_VS_Systick
RCC.LSCOPinFreq_Value=32000
USART3.IPParameters=VirtualMode-Asynchronous
PA10.Signal=UCPD1_DBCC2
Dma.UCPD1_RX.1.EventEnable=DISABLE
Dma.USART3_TX.2.SyncSignalID=NONE
PC11.Mode=Full_Duplex_Master
NVIC.USB_LP_IRQn=true\:5\:0\:false\:false\:true\:false\:false\:true
RCC.PLLPoutputFreq_Value=170000000
Dma.UCPD1_RX.1.Mode=DMA_NORMAL
RCC.APB1TimFreq_Value=170000000
NVIC.BusFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
RCC.LPUART1Freq_Value=170000000
PB13.Mode=CTS_RTS
ProjectManager.CustomerFirmwarePackage=
PF1-OSC_OUT.Signal=SPI2_SCK
PC4.Mode=Asynchronous
RCC.HSI48_VALUE=48000000
RCC.HRTIM1Freq_Value=170000000
PA5.Mode=FRSTX_CC2
RCC.PLLQoutputFreq_Value=170000000
ProjectManager.ProjectFileName=stm32cubemx_config.ioc
FREERTOS.Tasks01=defaultTask,0,128,StartDefaultTask,Default,NULL,Dynamic,NULL,NULL
ADC1.Rank-0\#ChannelRegularConversion=1
Mcu.PinsNb=62
ADC1.IPParameters=Rank-0\#ChannelRegularConversion,Channel-0\#ChannelRegularConversion,SamplingTime-0\#ChannelRegularConversion,OffsetNumber-0\#ChannelRegularConversion,NbrOfConversionFlag,master
ADC1.OffsetNumber-0\#ChannelRegularConversion=ADC_OFFSET_NONE
PC13.Signal=RTC_TAMP1
PC6.Signal=S_TIM3_CH1
PC2.Signal=ADC1_IN8
SH.S_TIM16_CH1.0=TIM16_CH1,PWM Generation1 CH1
VP_TIM16_VS_ClockSourceINT.Mode=Enable_Timer
Dma.UCPD1_TX.0.Direction=DMA_MEMORY_TO_PERIPH
Dma.UCPD1_RX.1.SignalID=NONE
PC0.Signal=ADC1_IN6
PC14-OSC32_IN.Signal=RCC_OSC32_IN
Dma.UCPD1_RX.1.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
RCC.QSPIFreq_Value=170000000
VP_TIM17_VS_ClockSourceINT.Signal=TIM17_VS_ClockSourceINT
Mcu.Pin60=VP_USBPD_VS_usbpd_tim1
Mcu.Pin61=VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS
Dma.UCPD1_RX.1.RequestNumber=1
Dma.UCPD1_RX.1.Priority=DMA_PRIORITY_LOW
PC3.GPIOParameters=GPIO_Label
Dma.USART3_TX.2.PeriphInc=DMA_PINC_DISABLE
PA3.Mode=Single Bank 1
PA8.GPIO_Label=GPIO0
Mcu.Pin59=VP_USBPD_VS_PD3FULL
Mcu.Pin57=VP_TRACER_EMB_VS_traceremb_usart3
Mcu.Pin58=VP_USBPD_VS_USBPD1
PB11.Mode=Asynchronous
Mcu.Pin51=VP_FREERTOS_VS_CMSIS_V1
Mcu.Pin52=VP_RTC_VS_RTC_Activate
SH.COMP_DAC11_group.0=DAC1_OUT1,DAC_OUT1
Mcu.Pin50=PB9
Mcu.Pin55=VP_TIM16_VS_ClockSourceINT
Mcu.Pin56=VP_TIM17_VS_ClockSourceINT
Mcu.Pin53=VP_SYS_VS_Systick
Mcu.Pin54=VP_SYS_VS_DBSignals
PA9.Signal=UCPD1_DBCC1
SH.S_TIM2_CH2.ConfNb=1
Mcu.Pin48=PB7
Mcu.Pin49=PB8-BOOT0
Mcu.Pin46=PB5
Mcu.Pin47=PB6
PB10.Signal=S_TIM2_CH3
PB14.Signal=USART3_RTS
Dma.USART3_TX.2.SyncRequestNumber=1
PA5.Signal=UCPD1_FRSTX1
Mcu.Pin40=PC10
Mcu.Pin41=PC11
Mcu.Pin44=PB3
PC12.Mode=FRSTX_CC2
Mcu.Pin45=PB4
PB8-BOOT0.Signal=S_TIM16_CH1
Mcu.Pin42=PC12
Mcu.Pin43=PD2
ProjectManager.LastFirmware=true
RCC.ADC345Freq_Value=170000000
Mcu.Pin37=PA13
Dma.UCPD1_TX.0.PeriphInc=DMA_PINC_DISABLE
Mcu.Pin38=PA14
Mcu.Pin35=PA11
RCC.I2C1Freq_Value=170000000
Mcu.Pin36=PA12
VP_SYS_VS_DBSignals.Signal=SYS_VS_DBSignals
Mcu.Pin39=PA15
RCC.RNGFreq_Value=48000000
Mcu.Pin30=PC8
Dma.UCPD1_TX.0.MemInc=DMA_MINC_ENABLE
Mcu.Pin33=PA9
TIM3.IPParameters=Channel-PWM Generation1 CH1,Channel-PWM Generation2 CH2
Mcu.Pin34=PA10
Mcu.Pin31=PC9
Mcu.Pin32=PA8
VP_USBPD_VS_usbpd_tim1.Signal=USBPD_VS_usbpd_tim1
VP_TIM16_VS_ClockSourceINT.Signal=TIM16_VS_ClockSourceINT
NVIC.NonMaskableInt_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
SH.S_TIM2_CH3.ConfNb=1
PA13.Mode=Serial_Wire
ProjectManager.FreePins=false
Mcu.Pin26=PB14
Mcu.Pin27=PB15
Mcu.Pin24=PB12
ProjectManager.UnderRoot=false
Mcu.Pin25=PB13
Mcu.Pin28=PC6
PC8.Mode=I2C
Mcu.Pin29=PC7
PA4.Signal=COMP_DAC11_group
PB5.Signal=SPI3_MOSI
Mcu.Pin22=PB10
VP_TRACER_EMB_VS_traceremb_usart3.Mode=TRACER_EMB_USART3
Mcu.Pin23=PB11
Mcu.Pin20=PB1
ADC1.master=1
Mcu.Pin21=PB2
NVIC.ForceEnableDMAVector=true
NVIC.MemoryManagement_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
ProjectManager.CompilerOptimize=6
PA11.Signal=USB_DM
ProjectManager.HeapSize=0x200
Mcu.Pin15=PA6
NVIC.HardFault_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.Pin16=PA7
PB1.Mode=Single Bank 1
Mcu.Pin13=PA4
Mcu.Pin14=PA5
Mcu.Pin19=PB0
SH.S_TIM3_CH1.ConfNb=1
ProjectManager.ComputerToolchain=false
Mcu.Pin17=PC4
Mcu.Pin18=PC5
SH.S_TIM17_CH1.0=TIM17_CH1,PWM Generation1 CH1
Dma.USART3_TX.2.Instance=DMA1_Channel3
NVIC.PriorityGroup=NVIC_PRIORITYGROUP_4
Mcu.Pin11=PA2
TIM3.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
Mcu.Pin12=PA3
Mcu.Pin10=PA1
PC3.GPIO_Label=GPIO4
RCC.PWRFreq_Value=170000000
NVIC.DMA1_Channel1_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
PF0-OSC_IN.Signal=SPI2_NSS
PD2.Signal=GPIO_Input
RCC.I2C2Freq_Value=170000000
PB0.Signal=QUADSPI1_BK1_IO1
VP_USBPD_VS_usbpd_tim1.Mode=TIM1
PC1.Signal=ADC1_IN7
PB12.GPIOParameters=GPIO_Label
PD2.GPIO_Label=GPIO5
PC1.Mode=IN7-Single-Ended
Mcu.Family=STM32G4
Dma.USART3_TX.2.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
ProjectManager.MainLocation=Src
PA6.Mode=Single Bank 1
USB_DEVICE.CLASS_NAME_FS=CDC
Dma.UCPD1_TX.0.SignalID=NONE
SPI2.VirtualNSS=VM_NSSHARD
RCC.SAI1Freq_Value=170000000
Dma.UCPD1_RX.1.MemDataAlignment=DMA_MDATAALIGN_BYTE
RCC.CortexFreq_Value=170000000
TIM2.Channel-Input_Capture1_from_TI1=TIM_CHANNEL_1
ProjectManager.KeepUserCode=true
Mcu.UserName=STM32G473RETx
PC10.Signal=USART3_TX
SH.S_TIM17_CH1.ConfNb=1
Dma.UCPD1_TX.0.Priority=DMA_PRIORITY_LOW
ProjectManager.functionlistsort=1-MX_GPIO_Init-GPIO-false-HAL-true,2-MX_DMA_Init-DMA-false-HAL-true,3-SystemClock_Config-RCC-false-HAL-false,4-MX_ADC1_Init-ADC1-false-HAL-true,5-MX_RTC_Init-RTC-false-HAL-true,6-MX_SPI2_Init-SPI2-false-HAL-true,7-MX_UCPD1_Init-UCPD1-false-LL-true,8-MX_USART3_UART_Init-USART3-false-HAL-true,9-MX_DAC1_Init-DAC1-false-HAL-true,10-MX_USART1_UART_Init-USART1-false-HAL-true,11-MX_USBPD_Init-USBPD-false-HAL-false,12-MX_USB_Device_Init-USB_DEVICE-false-HAL-false,13-MX_I2C3_Init-I2C3-false-HAL-true,14-MX_QUADSPI1_Init-QUADSPI1-false-HAL-true,15-MX_SPI3_Init-SPI3-false-HAL-true,16-MX_TIM2_Init-TIM2-false-HAL-true,17-MX_TIM3_Init-TIM3-false-HAL-true,18-MX_TIM16_Init-TIM16-false-HAL-true,19-MX_TIM17_Init-TIM17-false-HAL-true,20-MX_TRACER_EMB_Init-TRACER_EMB-false-HAL-true
PA11.Mode=Device
RCC.USART2Freq_Value=170000000
PD2.Locked=true
TIM2.Channel-PWM\ Generation2\ CH2=TIM_CHANNEL_2
PB11.Signal=USART3_RX
USB.lpm_enable=ENABLE
PB15.Signal=SPI2_MOSI
ProjectManager.StackSize=0x400
Dma.UCPD1_RX.1.MemInc=DMA_MINC_ENABLE
Dma.UCPD1_TX.0.Instance=DMA1_Channel1
RCC.I2C3Freq_Value=170000000
Dma.UCPD1_TX.0.MemDataAlignment=DMA_MDATAALIGN_BYTE
Dma.USART3_TX.2.EventEnable=DISABLE
Mcu.IP4=I2C3
Mcu.IP5=NVIC
RCC.FCLKCortexFreq_Value=170000000
Mcu.IP2=DMA
Mcu.IP3=FREERTOS
Mcu.IP0=ADC1
Mcu.IP1=DAC1
PA12.Signal=USB_DP
Mcu.UserConstants=
Dma.UCPD1_TX.0.SyncEnable=DISABLE
Dma.UCPD1_TX.0.Mode=DMA_NORMAL
Mcu.ThirdPartyNb=0
RCC.HCLKFreq_Value=170000000
Mcu.IPNb=23
ProjectManager.PreviousToolchain=
PA8.GPIOParameters=GPIO_Label
Mcu.Pin6=PC1
Mcu.Pin7=PC2
Dma.UCPD1_RX.1.PeriphInc=DMA_PINC_DISABLE
Mcu.Pin8=PC3
Mcu.Pin9=PA0
FREERTOS.IPParameters=Tasks01
RCC.AHBFreq_Value=170000000
SPI2.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_4
Mcu.Pin0=PC13
Mcu.Pin1=PC14-OSC32_IN
TIM3.Channel-PWM\ Generation1\ CH1=TIM_CHANNEL_1
GPIO.groupedBy=Group By Peripherals
Mcu.Pin2=PC15-OSC32_OUT
Mcu.Pin3=PF0-OSC_IN
Mcu.Pin4=PF1-OSC_OUT
Mcu.Pin5=PC0
ADC1.Channel-0\#ChannelRegularConversion=ADC_CHANNEL_6
I2C3.IPParameters=Timing
RCC.HSE_VALUE=8000000
NVIC.DebugMonitor_IRQn=true\:0\:0\:false\:false\:true\:false\:false\:false
Mcu.IP10=SPI3
NVIC.SysTick_IRQn=true\:15\:0\:false\:false\:true\:true\:false\:true
Mcu.IP12=TIM2
Mcu.IP11=SYS
Mcu.IP18=USART1
Mcu.IP17=UCPD1
Mcu.IP19=USART3
Mcu.IP14=TIM16
PB4.Mode=Dual_Role_AllSignals
Mcu.IP13=TIM3
Mcu.IP16=TRACER_EMB
Mcu.IP15=TIM17
PC14-OSC32_IN.Mode=LSE-External-Oscillator
RCC.VCOInputFreq_Value=4000000
PA14.Mode=Serial_Wire
Dma.UCPD1_TX.0.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
PB5.Mode=Full_Duplex_Master
File.Version=6
VP_SYS_VS_DBSignals.Mode=DisableDeadBatterySignals
SH.S_TIM2_CH1.ConfNb=1
PB7.Signal=GPIO_Input
Mcu.IP21=USBPD
Mcu.IP20=USB
VP_TRACER_EMB_VS_traceremb_usart3.Signal=TRACER_EMB_VS_traceremb_usart3
Mcu.IP22=USB_DEVICE
SH.S_TIM3_CH1.0=TIM3_CH1,PWM Generation1 CH1
Dma.USART3_TX.2.Polarity=HAL_DMAMUX_REQ_GEN_RISING
Dma.RequestsNb=3
RCC.CRSFreq_Value=48000000
ProjectManager.ProjectName=stm32cubemx_config
Dma.UCPD1_RX.1.SyncPolarity=HAL_DMAMUX_SYNC_NO_EVENT
PB7.GPIO_Label=GPIO2
PA6.Signal=QUADSPI1_BK1_IO3
VP_USBPD_VS_PD3FULL.Signal=USBPD_VS_PD3FULL
Dma.UCPD1_TX.0.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
ProjectManager.ToolChainLocation=
RCC.LSI_VALUE=32000
PA15.Signal=S_TIM2_CH1
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Signal=USB_DEVICE_VS_USB_DEVICE_CDC_FS
I2C3.Timing=0x30A0A7FB
Dma.Request2=USART3_TX
Dma.Request1=UCPD1_RX
SPI3.IPParameters=VirtualType,Mode,Direction,BaudRatePrescaler,CalculateBaudRate
SPI2.Direction=SPI_DIRECTION_1LINE
PC5.Signal=USART1_RX
RCC.CK48CLockSelection=RCC_USBCLKSOURCE_HSI48
PF1-OSC_OUT.Mode=Simplex_Bidirectional_Master
SH.COMP_DAC11_group.ConfNb=1
Dma.Request0=UCPD1_TX
PB4.Signal=UCPD1_CC2
PA3.Signal=QUADSPI1_CLK
VP_RTC_VS_RTC_Activate.Signal=RTC_VS_RTC_Activate
PC15-OSC32_OUT.Mode=LSE-External-Oscillator
RCC.I2SFreq_Value=170000000
SH.S_TIM2_CH1.0=TIM2_CH1,Input_Capture1_from_TI1
Dma.USART3_TX.2.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
PA7.Mode=Single Bank 1
Dma.UCPD1_RX.1.SyncEnable=DISABLE
PA10.Mode=EnableDeadBattery
ProjectManager.NoMain=false
USB_DEVICE.VirtualModeFS=Cdc_FS
Dma.USART3_TX.2.MemInc=DMA_MINC_ENABLE
NVIC.SavedSvcallIrqHandlerGenerated=true
PC11.Signal=SPI3_MISO
PC8.Signal=I2C3_SCL
PC4.Signal=USART1_TX
PC10.Mode=Asynchronous
RCC.EXTERNAL_CLOCK_VALUE=12288000
ProjectManager.DefaultFWLocation=true
PC2.Mode=IN8-Single-Ended
USB.IPParameters=lpm_enable
PB12.Locked=true
ProjectManager.DeletePrevious=true
Dma.UCPD1_RX.1.SyncSignalID=NONE
USB_DEVICE.IPParameters=VirtualMode,VirtualModeFS,CLASS_NAME_FS
TIM16.Channel=TIM_CHANNEL_1
RCC.FamilyName=M
PC0.Mode=IN6-Single-Ended
USART1.VirtualMode-Asynchronous=VM_ASYNC
PA13.Signal=SYS_JTMS-SWDIO
VP_USBPD_VS_USBPD1.Mode=USBPD_P0
VP_FREERTOS_VS_CMSIS_V1.Signal=FREERTOS_VS_CMSIS_V1
SH.S_TIM2_CH2.0=TIM2_CH2,PWM Generation2 CH2
PA9.Mode=EnableDeadBattery
NVIC.DMA1_Channel2_IRQn=true\:5\:0\:false\:false\:true\:true\:false\:true
ProjectManager.TargetToolchain=SW4STM32
PB7.GPIOParameters=GPIO_Label
VP_USB_DEVICE_VS_USB_DEVICE_CDC_FS.Mode=CDC_FS
Dma.USART3_TX.2.Direction=DMA_MEMORY_TO_PERIPH
PB2.GPIOParameters=GPIO_Label
SPI2.IPParameters=VirtualType,Mode,Direction,BaudRatePrescaler,CalculateBaudRate,VirtualNSS
ProjectManager.RegisterCallBack=
RCC.USBFreq_Value=48000000
PC15-OSC32_OUT.Signal=RCC_OSC32_OUT
PA1.Signal=S_TIM2_CH2
PF0-OSC_IN.Mode=NSS_Signal_Hard_Output
SH.S_TIM3_CH2.0=TIM3_CH2,PWM Generation2 CH2
Dma.UCPD1_RX.1.Direction=DMA_PERIPH_TO_MEMORY
PB0.Mode=Single Bank 1
board=custom
RCC.VCOOutputFreq_Value=340000000
PB15.Mode=Simplex_Bidirectional_Master
Dma.USART3_TX.2.MemDataAlignment=DMA_MDATAALIGN_BYTE
NVIC.SavedSystickIrqHandlerGenerated=true
RCC.APB2Freq_Value=170000000
RCC.UART4Freq_Value=170000000
SPI3.CalculateBaudRate=42.5 MBits/s
MxCube.Version=6.1.0
Dma.UCPD1_TX.0.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
SH.S_TIM2_CH3.0=TIM2_CH3,Input_Capture3_from_TI3
RCC.FDCANFreq_Value=170000000
SPI3.BaudRatePrescaler=SPI_BAUDRATEPRESCALER_4
VP_SYS_VS_Systick.Mode=SysTick
RCC.UART5Freq_Value=170000000
PC13.Mode=Tamper 1 enabled
RCC.IPParameters=ADC12Freq_Value,ADC345Freq_Value,AHBFreq_Value,APB1Freq_Value,APB1TimFreq_Value,APB2Freq_Value,APB2TimFreq_Value,CK48CLockSelection,CRSFreq_Value,CortexFreq_Value,EXTERNAL_CLOCK_VALUE,FCLKCortexFreq_Value,FDCANFreq_Value,FamilyName,HCLKFreq_Value,HRTIM1Freq_Value,HSE_VALUE,HSI48_VALUE,HSI_VALUE,I2C1Freq_Value,I2C2Freq_Value,I2C3Freq_Value,I2C4Freq_Value,I2SFreq_Value,LPTIM1Freq_Value,LPUART1Freq_Value,LSCOPinFreq_Value,LSI_VALUE,MCO1PinFreq_Value,PLLM,PLLN,PLLPoutputFreq_Value,PLLQoutputFreq_Value,PLLRCLKFreq_Value,PWRFreq_Value,QSPIFreq_Value,RNGFreq_Value,SAI1Freq_Value,SYSCLKFreq_VALUE,SYSCLKSource,UART4Freq_Value,UART5Freq_Value,USART1Freq_Value,USART2Freq_Value,USART3Freq_Value,USBFreq_Value,VCOInputFreq_Value,VCOOutputFreq_Value
ProjectManager.AskForMigrate=false
Mcu.Name=STM32G473R(B-C-E)Tx
NVIC.SavedPendsvIrqHandlerGenerated=true
PA2.Signal=QUADSPI1_BK1_NCS
PB2.Locked=true
Mcu.IP8=RTC
Mcu.IP9=SPI2
Mcu.IP6=QUADSPI1
Mcu.IP7=RCC
ProjectManager.CoupleFile=false
PB3.Signal=SPI3_SCK
RCC.SYSCLKFreq_VALUE=170000000
PA12.Mode=Device
Dma.UCPD1_RX.1.PeriphDataAlignment=DMA_PDATAALIGN_BYTE
KeepUserPlacement=false
PA14.Signal=SYS_JTCK-SWCLK
Dma.USART3_TX.2.RequestParameters=Instance,Direction,PeriphInc,MemInc,PeriphDataAlignment,MemDataAlignment,Mode,Priority,SignalID,Polarity,RequestNumber,SyncSignalID,SyncPolarity,SyncEnable,EventEnable,SyncRequestNumber
PB2.GPIO_Label=GPIO1
RCC.HSI_VALUE=16000000
Dma.UCPD1_TX.0.Polarity=HAL_DMAMUX_REQ_GEN_RISING
ADC1.NbrOfConversionFlag=1
RCC.PLLM=RCC_PLLM_DIV4
RCC.PLLN=85
PB7.Locked=true
Dma.UCPD1_RX.1.Instance=DMA1_Channel2
PA2.Mode=Single Bank 1
PC9.Signal=I2C3_SDA
TIM16.IPParameters=Channel
RCC.APB1Freq_Value=170000000
USB_DEVICE.VirtualMode=Cdc
ProjectManager.DeviceId=STM32G473RETx
PB12.Signal=GPIO_Input
ProjectManager.LibraryCopy=1
PA7.Signal=QUADSPI1_BK1_IO2
